## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_linux_web_app.app-service will be created
  + resource "azurerm_linux_web_app" "app-service" {
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = false
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "norwayeast"
      + name                                           = "microsave-prod-app-service"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "microsave-externalapp-prod-resourcegroup"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + tags                                           = {
          + "environment" = "Prod"
        }
      + virtual_network_subnet_id                      = (known after apply)
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + site_config {
          + always_on                               = true
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + http2_enabled                           = false
          + ip_restriction_default_action           = "Allow"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + docker_image_name   = "aberner/microsave"
              + docker_registry_url = "https://index.docker.io"
            }
        }
    }

  # azurerm_linux_web_app.app-service-test will be created
  + resource "azurerm_linux_web_app" "app-service-test" {
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = false
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "norwayeast"
      + name                                           = "microsave-test-app-service"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "microsave-externalapp-test-resourcegroup"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + tags                                           = {
          + "environment" = "Test"
        }
      + virtual_network_subnet_id                      = (known after apply)
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + site_config {
          + always_on                               = true
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + http2_enabled                           = false
          + ip_restriction_default_action           = "Allow"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + docker_image_name   = "aberner/microsave"
              + docker_registry_url = "https://index.docker.io"
            }
        }
    }

  # azurerm_service_plan.app-service-plan will be created
  + resource "azurerm_service_plan" "app-service-plan" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "norwayeast"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "microsave-prod-app-service-plan"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "microsave-externalapp-prod-resourcegroup"
      + sku_name                     = "B1"
      + tags                         = {
          + "environment" = "Prod"
        }
      + worker_count                 = (known after apply)
    }

  # azurerm_service_plan.app-service-plan-test will be created
  + resource "azurerm_service_plan" "app-service-plan-test" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "norwayeast"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "microsave-test-app-service-plan"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "microsave-externalapp-test-resourcegroup"
      + sku_name                     = "B1"
      + tags                         = {
          + "environment" = "Test"
        }
      + worker_count                 = (known after apply)
    }

  # azurerm_virtual_machine_extension.linuxdb01-ext will be created
  + resource "azurerm_virtual_machine_extension" "linuxdb01-ext" {
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "linuxdb01-ext"
      + publisher                   = "Microsoft.Azure.Extensions"
      + settings                    = <<-EOT
            {
              "script": "IyEvYmluL2Jhc2gKc3VkbyBzZWQgLWkgJ3MvIyRucmNvbmZ7cmVzdGFydH0gPSAnIiciJ2knIiciJzsvJG5yY29uZntyZXN0YXJ0fSA9ICciJyInYSciJyInOy9nJyAvZXRjL25lZWRyZXN0YXJ0L25lZWRyZXN0YXJ0LmNvbmYKc3VkbyBhcHQgdXBkYXRlIC15CnN1ZG8gYXB0IHVwZ3JhZGUgLXkKc3VkbyBhcHQgaW5zdGFsbCBnbnVwZyBjdXJsIC15CmN1cmwgLWZzU0wgaHR0cHM6Ly93d3cubW9uZ29kYi5vcmcvc3RhdGljL3BncC9zZXJ2ZXItOC4wLmFzYyB8IHN1ZG8gZ3BnIC1vIC91c3Ivc2hhcmUva2V5cmluZ3MvbW9uZ29kYi1zZXJ2ZXItOC4wLmdwZyAtLWRlYXJtb3IKZWNobyAiZGViIFsgYXJjaD1hbWQ2NCxhcm02NCBzaWduZWQtYnk9L3Vzci9zaGFyZS9rZXlyaW5ncy9tb25nb2RiLXNlcnZlci04LjAuZ3BnIF0gaHR0cHM6Ly9yZXBvLm1vbmdvZGIub3JnL2FwdC91YnVudHUgamFtbXkvbW9uZ29kYi1vcmcvOC4wIG11bHRpdmVyc2UiIHwgc3VkbyB0ZWUgL2V0Yy9hcHQvc291cmNlcy5saXN0LmQvbW9uZ29kYi1vcmctOC4wLmxpc3QKc3VkbyBhcHQgdXBkYXRlIC15CnN1ZG8gYXB0LWdldCBpbnN0YWxsIC15IG1vbmdvZGItb3JnCnN1ZG8gc3lzdGVtY3RsIHN0YXJ0IG1vbmdvZApzdWRvIHN5c3RlbWN0bCBlbmFibGUgbW9uZ29kCmV4aXQgMAo="
             }
        EOT
      + type                        = "CustomScript"
      + type_handler_version        = "2.0"
      + virtual_machine_id          = (known after apply)
    }

  # module.app-windows-01.azurerm_network_interface.nic will be created
  + resource "azurerm_network_interface" "nic" {
      + applied_dns_servers         = (known after apply)
      + id                          = (known after apply)
      + internal_domain_name_suffix = (known after apply)
      + location                    = "norwayeast"
      + mac_address                 = (known after apply)
      + name                        = "win-app01-nic"
      + private_ip_address          = (known after apply)
      + private_ip_addresses        = (known after apply)
      + resource_group_name         = "microsave-internapp-resourcegroup"
      + virtual_machine_id          = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "ipconfig1"
          + primary                                            = (known after apply)
          + private_ip_address                                 = "10.51.1.4"
          + private_ip_address_allocation                      = "Static"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = (known after apply)
        }
    }

  # module.app-windows-01.azurerm_virtual_machine.vm will be created
  + resource "azurerm_virtual_machine" "vm" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = true
      + delete_os_disk_on_termination    = true
      + id                               = (known after apply)
      + license_type                     = (known after apply)
      + location                         = "norwayeast"
      + name                             = "win-app01"
      + network_interface_ids            = (known after apply)
      + resource_group_name              = "microsave-internapp-resourcegroup"
      + vm_size                          = "Standard_A1_v2"

      + os_profile {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + os_profile_windows_config {
          + enable_automatic_upgrades = false
          + provision_vm_agent        = true
            # (1 unchanged attribute hidden)
        }

      + storage_data_disk (known after apply)

      + storage_image_reference {
            id        = null
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2019-Datacenter"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Standard_LRS"
          + name                      = "winapp01osdisk"
          + os_type                   = (known after apply)
          + write_accelerator_enabled = false
        }
    }

  # module.azure_firewall_01.azurerm_firewall.az-firewall will be created
  + resource "azurerm_firewall" "az-firewall" {
      + dns_proxy_enabled   = (known after apply)
      + firewall_policy_id  = (known after apply)
      + id                  = (known after apply)
      + location            = "norwayeast"
      + name                = "microsave-firewall"
      + resource_group_name = "microsave-hub-resourcegroup"
      + sku_name            = "AZFW_VNet"
      + sku_tier            = "Basic"
      + threat_intel_mode   = (known after apply)

      + ip_configuration {
          + name                 = "configuration"
          + private_ip_address   = (known after apply)
          + public_ip_address_id = (known after apply)
          + subnet_id            = (known after apply)
        }

      + management_ip_configuration {
          + name                 = "management"
          + private_ip_address   = (known after apply)
          + public_ip_address_id = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # module.azure_firewall_policy_01.azurerm_firewall_policy.az-firewall-pol01 will be created
  + resource "azurerm_firewall_policy" "az-firewall-pol01" {
      + child_policies           = (known after apply)
      + firewalls                = (known after apply)
      + id                       = (known after apply)
      + location                 = "norwayeast"
      + name                     = "microsave-firwall-policy-pol01"
      + resource_group_name      = "microsave-hub-resourcegroup"
      + rule_collection_groups   = (known after apply)
      + sku                      = "Basic"
      + threat_intelligence_mode = "Alert"
    }

  # module.azure_firewall_rule_coll_group.azurerm_firewall_policy_rule_collection_group.az-collection-pol01 will be created
  + resource "azurerm_firewall_policy_rule_collection_group" "az-collection-pol01" {
      + firewall_policy_id = (known after apply)
      + id                 = (known after apply)
      + name               = "conn-afw-coll-pol01"
      + priority           = 150

      + application_rule_collection {
          + action   = "Allow"
          + name     = "Allowed_websites"
          + priority = 4000

          + rule {
              + destination_fqdns = [
                  + "whatismyipaddress.com",
                ]
              + name              = "Allowed_website_01"
              + source_addresses  = [
                  + "*",
                ]

              + protocols {
                  + port = 80
                  + type = "Http"
                }
              + protocols {
                  + port = 443
                  + type = "Https"
                }
            }
          + rule {
              + destination_fqdns = [
                  + "*.google.com",
                ]
              + name              = "Allowed_website_02"
              + source_addresses  = [
                  + "*",
                ]

              + protocols {
                  + port = 80
                  + type = "Http"
                }
              + protocols {
                  + port = 443
                  + type = "Https"
                }
            }
          + rule {
              + destination_fqdns = [
                  + "*.advisense.com",
                ]
              + name              = "Allowed_website_03"
              + source_addresses  = [
                  + "*",
                ]

              + protocols {
                  + port = 80
                  + type = "Http"
                }
              + protocols {
                  + port = 443
                  + type = "Https"
                }
            }
        }

      + nat_rule_collection {
          + action   = "Dnat"
          + name     = "DNATCollection"
          + priority = 1000

          + rule {
              + destination_address = (known after apply)
              + destination_ports   = [
                  + "3389",
                ]
              + name                = "DNATRuleRDP"
              + protocols           = [
                  + "TCP",
                ]
              + source_addresses    = [
                  + "*",
                ]
              + translated_address  = "10.51.1.4"
              + translated_port     = 3389
            }
        }

      + network_rule_collection {
          + action   = "Allow"
          + name     = "Allowed_Network_Rules"
          + priority = 3000

          + rule {
              + destination_addresses = [
                  + "10.52.0.0/16",
                ]
              + destination_ports     = [
                  + "*",
                ]
              + name                  = "SpokeInternalApptoSpokeWorkstations"
              + protocols             = [
                  + "Any",
                ]
              + source_addresses      = [
                  + "10.51.0.0/16",
                ]
            }
          + rule {
              + destination_addresses = [
                  + "10.51.0.0/16",
                ]
              + destination_ports     = [
                  + "*",
                ]
              + name                  = "SpokeWorkstationstoSpokeSpokeInternalApp"
              + protocols             = [
                  + "Any",
                ]
              + source_addresses      = [
                  + "10.52.0.0/16",
                ]
            }
          + rule {
              + destination_addresses = [
                  + "10.53.0.0/16",
                ]
              + destination_ports     = [
                  + "*",
                ]
              + name                  = "SpokeInternalApptoSpokeExternalApp"
              + protocols             = [
                  + "Any",
                ]
              + source_addresses      = [
                  + "10.51.0.0/16",
                ]
            }
          + rule {
              + destination_addresses = [
                  + "10.53.0.0/16",
                ]
              + destination_ports     = [
                  + "*",
                ]
              + name                  = "SpokeWorkstationstoSpokeExternalApp"
              + protocols             = [
                  + "Any",
                ]
              + source_addresses      = [
                  + "10.52.0.0/16",
                ]
            }
          + rule {
              + destination_addresses = [
                  + "10.51.0.0/16",
                ]
              + destination_ports     = [
                  + "*",
                ]
              + name                  = "SpokeExternalApptoSpokeInternalApp"
              + protocols             = [
                  + "Any",
                ]
              + source_addresses      = [
                  + "10.53.0.0/16",
                ]
            }
          + rule {
              + destination_addresses = [
                  + "10.52.0.0/16",
                ]
              + destination_ports     = [
                  + "*",
                ]
              + name                  = "SpokeExternalApptoSpokeWorkstations"
              + protocols             = [
                  + "Any",
                ]
              + source_addresses      = [
                  + "10.53.0.0/16",
                ]
            }
          + rule {
              + destination_addresses = [
                  + "*",
                ]
              + destination_ports     = [
                  + "80",
                  + "443",
                ]
              + name                  = "DatabasetoInternet"
              + protocols             = [
                  + "Any",
                ]
              + source_addresses      = [
                  + "10.51.2.4",
                ]
            }
        }
    }

  # module.desktop-windows-01.azurerm_network_interface.nic will be created
  + resource "azurerm_network_interface" "nic" {
      + applied_dns_servers         = (known after apply)
      + id                          = (known after apply)
      + internal_domain_name_suffix = (known after apply)
      + location                    = "norwayeast"
      + mac_address                 = (known after apply)
      + name                        = "vm01-nic"
      + private_ip_address          = (known after apply)
      + private_ip_addresses        = (known after apply)
      + resource_group_name         = "microsave-workstations-resourcegroup"
      + virtual_machine_id          = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "ipconfig1"
          + primary                                            = (known after apply)
          + private_ip_address                                 = "10.52.1.4"
          + private_ip_address_allocation                      = "Static"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = (known after apply)
        }
    }

  # module.desktop-windows-01.azurerm_virtual_machine.vm will be created
  + resource "azurerm_virtual_machine" "vm" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = true
      + delete_os_disk_on_termination    = true
      + id                               = (known after apply)
      + license_type                     = (known after apply)
      + location                         = "norwayeast"
      + name                             = "microsavevm01"
      + network_interface_ids            = (known after apply)
      + resource_group_name              = "microsave-workstations-resourcegroup"
      + vm_size                          = "Standard_B2s"

      + os_profile {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + os_profile_windows_config {
          + enable_automatic_upgrades = false
          + provision_vm_agent        = true
            # (1 unchanged attribute hidden)
        }

      + storage_data_disk (known after apply)

      + storage_image_reference {
            id        = null
          + offer     = "windows-11"
          + publisher = "MicrosoftWindowsDesktop"
          + sku       = "win11-23h2-pro"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Standard_LRS"
          + name                      = "wm01osdisk"
          + os_type                   = (known after apply)
          + write_accelerator_enabled = false
        }
    }

  # module.externalapp-prod-resourcegroup.azurerm_resource_group.az-rg will be created
  + resource "azurerm_resource_group" "az-rg" {
      + id       = (known after apply)
      + location = "norwayeast"
      + name     = "microsave-externalapp-prod-resourcegroup"
      + tags     = {
          + "Environment" = "Prod"
          + "Role"        = "ExternalApp"
        }
    }

  # module.externalapp-prod-to-hub.azurerm_virtual_network_peering.peering will be created
  + resource "azurerm_virtual_network_peering" "peering" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = false
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "microsave-externalapp-prod-vnet-to-az-conn-vnet"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = (known after apply)
      + resource_group_name                    = "microsave-externalapp-prod-resourcegroup"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "microsave-vnet-externalapp-prod"
    }

  # module.externalapp-prod-vnet.azurerm_subnet.subnet["microsave-prod-apps-snet"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                              = [
          + "10.53.1.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "microsave-prod-apps-snet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "microsave-externalapp-prod-resourcegroup"
      + virtual_network_name                          = "microsave-vnet-externalapp-prod"

      + delegation {
          + name = "delegation-appService"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              + name    = "Microsoft.Web/serverFarms"
            }
        }
    }

  # module.externalapp-prod-vnet.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.53.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "norwayeast"
      + name                = "microsave-vnet-externalapp-prod"
      + resource_group_name = "microsave-externalapp-prod-resourcegroup"
      + subnet              = (known after apply)
    }

  # module.externalapp-test-resourcegroup.azurerm_resource_group.az-rg will be created
  + resource "azurerm_resource_group" "az-rg" {
      + id       = (known after apply)
      + location = "norwayeast"
      + name     = "microsave-externalapp-test-resourcegroup"
      + tags     = {
          + "Environment" = "Test"
          + "Role"        = "CustomerApps"
        }
    }

  # module.externalapp-test-to-hub.azurerm_virtual_network_peering.peering will be created
  + resource "azurerm_virtual_network_peering" "peering" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = false
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "microsave-externalapp-test-vnet-to-az-conn-vnet"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = (known after apply)
      + resource_group_name                    = "microsave-externalapp-test-resourcegroup"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "microsave-test-noeast-vnet-test"
    }

  # module.externalapp-test-vnet.azurerm_subnet.subnet["microsave-test-apps-snet"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                              = [
          + "10.54.1.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "microsave-test-apps-snet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "microsave-externalapp-test-resourcegroup"
      + virtual_network_name                          = "microsave-test-noeast-vnet-test"

      + delegation {
          + name = "delegation-appService"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              + name    = "Microsoft.Web/serverFarms"
            }
        }
    }

  # module.externalapp-test-vnet.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.54.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "norwayeast"
      + name                = "microsave-test-noeast-vnet-test"
      + resource_group_name = "microsave-externalapp-test-resourcegroup"
      + subnet              = (known after apply)
    }

  # module.hub-resourcegroup.azurerm_resource_group.az-rg will be created
  + resource "azurerm_resource_group" "az-rg" {
      + id       = (known after apply)
      + location = "norwayeast"
      + name     = "microsave-hub-resourcegroup"
      + tags     = {
          + "Environment" = "Prod"
          + "Role"        = "Hub"
        }
    }

  # module.hub-to-externalapp-prod.azurerm_virtual_network_peering.peering will be created
  + resource "azurerm_virtual_network_peering" "peering" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = true
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "conn-vnet-to-az-externalapp-prod-vnet"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = (known after apply)
      + resource_group_name                    = "microsave-hub-resourcegroup"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "microsave-hub-vnet"
    }

  # module.hub-to-externalapp-test.azurerm_virtual_network_peering.peering will be created
  + resource "azurerm_virtual_network_peering" "peering" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = true
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "conn-vnet-to-az-externalapp-test-vnet"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = (known after apply)
      + resource_group_name                    = "microsave-hub-resourcegroup"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "microsave-hub-vnet"
    }

  # module.hub-to-spoke-internalapp.azurerm_virtual_network_peering.peering will be created
  + resource "azurerm_virtual_network_peering" "peering" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = true
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "prod-vnet-to-az-microsave-internalapp-vnet"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = (known after apply)
      + resource_group_name                    = "microsave-hub-resourcegroup"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "microsave-hub-vnet"
    }

  # module.hub-to-workstations.azurerm_virtual_network_peering.peering will be created
  + resource "azurerm_virtual_network_peering" "peering" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = true
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "microsave-vnet-to-az-workstation-vnet"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = (known after apply)
      + resource_group_name                    = "microsave-hub-resourcegroup"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "microsave-hub-vnet"
    }

  # module.hub-vnet.azurerm_subnet.subnet["ApplicationGatewaySubnet"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                              = [
          + "10.50.3.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "ApplicationGatewaySubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "microsave-hub-resourcegroup"
      + virtual_network_name                          = "microsave-hub-vnet"
    }

  # module.hub-vnet.azurerm_subnet.subnet["AzureBastionSubnet"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                              = [
          + "10.50.4.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "AzureBastionSubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "microsave-hub-resourcegroup"
      + virtual_network_name                          = "microsave-hub-vnet"
    }

  # module.hub-vnet.azurerm_subnet.subnet["AzureFirewallManagementSubnet"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                              = [
          + "10.50.6.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "AzureFirewallManagementSubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "microsave-hub-resourcegroup"
      + virtual_network_name                          = "microsave-hub-vnet"
    }

  # module.hub-vnet.azurerm_subnet.subnet["AzureFirewallSubnet"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                              = [
          + "10.50.2.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "AzureFirewallSubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "microsave-hub-resourcegroup"
      + virtual_network_name                          = "microsave-hub-vnet"
    }

  # module.hub-vnet.azurerm_subnet.subnet["GatewaySubnet"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                              = [
          + "10.50.1.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "GatewaySubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "microsave-hub-resourcegroup"
      + virtual_network_name                          = "microsave-hub-vnet"
    }

  # module.hub-vnet.azurerm_subnet.subnet["JumpboxSubnet"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                              = [
          + "10.50.5.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "JumpboxSubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "microsave-hub-resourcegroup"
      + virtual_network_name                          = "microsave-hub-vnet"
    }

  # module.hub-vnet.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.50.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "norwayeast"
      + name                = "microsave-hub-vnet"
      + resource_group_name = "microsave-hub-resourcegroup"
      + subnet              = (known after apply)
    }

  # module.internal-workstation-resourcegroup.azurerm_resource_group.az-rg will be created
  + resource "azurerm_resource_group" "az-rg" {
      + id       = (known after apply)
      + location = "norwayeast"
      + name     = "microsave-workstations-resourcegroup"
      + tags     = {
          + "Environment" = "Prod"
          + "Role"        = "Workstations"
        }
    }

  # module.internalapp-resourcegroup.azurerm_resource_group.az-rg will be created
  + resource "azurerm_resource_group" "az-rg" {
      + id       = (known after apply)
      + location = "norwayeast"
      + name     = "microsave-internapp-resourcegroup"
      + tags     = {
          + "Environment" = "Prod"
          + "Role"        = "InternalApp"
        }
    }

  # module.internalapp-to-hub.azurerm_virtual_network_peering.peering will be created
  + resource "azurerm_virtual_network_peering" "peering" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = false
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "microsave-internalapp-vnet-to-az-conn-vnet"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = (known after apply)
      + resource_group_name                    = "microsave-internapp-resourcegroup"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "microsave-vnet-internalapp"
    }

  # module.internalapp-vnet.azurerm_subnet.subnet["microsave-prod-db-snet"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                              = [
          + "10.51.2.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "microsave-db-snet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "microsave-internapp-resourcegroup"
      + virtual_network_name                          = "microsave-vnet-internalapp"
    }

  # module.internalapp-vnet.azurerm_subnet.subnet["microsave-prod-web-snet"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                              = [
          + "10.51.1.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "microsave-web-snet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "microsave-internapp-resourcegroup"
      + virtual_network_name                          = "microsave-vnet-internalapp"
    }

  # module.internalapp-vnet.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.51.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "norwayeast"
      + name                = "microsave-vnet-internalapp"
      + resource_group_name = "microsave-internapp-resourcegroup"
      + subnet              = (known after apply)
    }

  # module.public_ip_01.azurerm_public_ip.pip will be created
  + resource "azurerm_public_ip" "pip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "norwayeast"
      + name                    = "microsave-vpn-gateway-public-ip-pip01"
      + resource_group_name     = "microsave-hub-resourcegroup"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # module.public_ip_02.azurerm_public_ip.pip will be created
  + resource "azurerm_public_ip" "pip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "norwayeast"
      + name                    = "microsave-firewall-public-ip-pip02"
      + resource_group_name     = "microsave-hub-resourcegroup"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # module.public_ip_03.azurerm_public_ip.pip will be created
  + resource "azurerm_public_ip" "pip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "norwayeast"
      + name                    = "microsave-bastion-public-ip-pip03"
      + resource_group_name     = "microsave-hub-resourcegroup"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # module.public_ip_04.azurerm_public_ip.pip will be created
  + resource "azurerm_public_ip" "pip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "norwayeast"
      + name                    = "microsave-firewall-management-public-ip-pip04"
      + resource_group_name     = "microsave-hub-resourcegroup"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # module.route_tables.azurerm_route_table.spoke-to-firewall will be created
  + resource "azurerm_route_table" "spoke-to-firewall" {
      + bgp_route_propagation_enabled = false
      + id                            = (known after apply)
      + location                      = "norwayeast"
      + name                          = "microsave-prod-route"
      + resource_group_name           = "microsave-hub-resourcegroup"
      + route                         = [
          + {
              + address_prefix         = "0.0.0.0/0"
              + name                   = "ToAzureFirewall"
              + next_hop_in_ip_address = (known after apply)
              + next_hop_type          = "VirtualAppliance"
            },
        ]
      + subnets                       = (known after apply)
    }

  # module.route_tables.azurerm_subnet_route_table_association.spoke-to-firewall[0] will be created
  + resource "azurerm_subnet_route_table_association" "spoke-to-firewall" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.route_tables.azurerm_subnet_route_table_association.spoke-to-firewall[1] will be created
  + resource "azurerm_subnet_route_table_association" "spoke-to-firewall" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.route_tables.azurerm_subnet_route_table_association.spoke-to-firewall[2] will be created
  + resource "azurerm_subnet_route_table_association" "spoke-to-firewall" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.route_tables.azurerm_subnet_route_table_association.spoke-to-firewall[3] will be created
  + resource "azurerm_subnet_route_table_association" "spoke-to-firewall" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.route_tables.azurerm_subnet_route_table_association.spoke-to-firewall[4] will be created
  + resource "azurerm_subnet_route_table_association" "spoke-to-firewall" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vm-bastion.azurerm_bastion_host.bastion will be created
  + resource "azurerm_bastion_host" "bastion" {
      + copy_paste_enabled     = true
      + dns_name               = (known after apply)
      + file_copy_enabled      = false
      + id                     = (known after apply)
      + ip_connect_enabled     = false
      + kerberos_enabled       = false
      + location               = "norwayeast"
      + name                   = "microsave-bastion"
      + resource_group_name    = "microsave-hub-resourcegroup"
      + scale_units            = 2
      + shareable_link_enabled = false
      + sku                    = "Basic"
      + tunneling_enabled      = false

      + ip_configuration {
          + name                 = "configuration"
          + public_ip_address_id = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # module.vm-linux-01.azurerm_linux_virtual_machine.linux-vm will be created
  + resource "azurerm_linux_virtual_machine" "linux-vm" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "microsave.admin"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disable_password_authentication                        = false
      + disk_controller_type                                   = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "norwayeast"
      + max_bid_price                                          = -1
      + name                                                   = "linuxdb01"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "ImageDefault"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "microsave-internapp-resourcegroup"
      + size                                                   = "Standard_A1_v2"
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = false

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = 255
          + name                      = "linuxdb01osdisk"
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-jammy"
          + publisher = "Canonical"
          + sku       = "22_04-lts"
          + version   = "latest"
        }

      + termination_notification (known after apply)
    }

  # module.vm-linux-01.azurerm_network_interface.nic will be created
  + resource "azurerm_network_interface" "nic" {
      + applied_dns_servers         = (known after apply)
      + id                          = (known after apply)
      + internal_domain_name_suffix = (known after apply)
      + location                    = "norwayeast"
      + mac_address                 = (known after apply)
      + name                        = "linux-db01-nic"
      + private_ip_address          = (known after apply)
      + private_ip_addresses        = (known after apply)
      + resource_group_name         = "microsave-internapp-resourcegroup"
      + virtual_machine_id          = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "ipconfig1"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = (known after apply)
        }
    }

  # module.workstations-to-hub.azurerm_virtual_network_peering.peering will be created
  + resource "azurerm_virtual_network_peering" "peering" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = false
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "microsave-workstation-vnet-to-az-conn-vnet"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = (known after apply)
      + resource_group_name                    = "microsave-workstations-resourcegroup"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "microsave-vnet-workstations"
    }

  # module.workstations-vnet.azurerm_subnet.subnet["microsave-vms-snet"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                              = [
          + "10.52.1.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "microsave-wms-snet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "microsave-workstations-resourcegroup"
      + virtual_network_name                          = "microsave-vnet-workstations"
    }

  # module.workstations-vnet.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.52.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "norwayeast"
      + name                = "microsave-vnet-workstations"
      + resource_group_name = "microsave-workstations-resourcegroup"
      + subnet              = (known after apply)
    }

Plan: 54 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + app_service_url_prod = (known after apply)
  + app_service_url_test = (known after apply)
```
</details>